tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# tap "neovim/neovim"

brew "readline"
brew "graphviz"
brew "git"
brew "python3"
brew "pyenv"
brew "imagemagick"
brew "jq"
brew "nginx"
brew "ripgrep"
brew "speedtest-cli"
brew "trash"
brew "thefuck"
brew "fzf"
brew "htop"
brew "ssh-copy-id", link: true
brew "telnet"
brew "terraform"
brew "tldr"
brew "tmux"
brew "tree"
brew "unzip"
brew "youtube-dl"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "neovim"
brew "wget"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"

cask "google-drive"
cask  "maccy"
cask "anki"
cask "bitwarden"
cask "dash"
cask "docker"
cask "firefox"
cask "flux"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "ngrok"
cask "insomnia"
#cask "postman"
cask "quicklook-json"
cask "visual-studio-code"
cask "vlc"
cask "slack"
cask "gimp"
cask "spotify"
cask "discord"
cask "alfred"
cask "jetbrains-toolbox"
cask "nextcloud"
cask "obsidian"
cask "teamviewer"
cask "zerotier-one"
