# Install this file by running $ brew bundle
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "warrensbox/tap/tfswitch"
tap "turbot/tap"
tap "nicholasdille/tap"

# Command line applications
brew "mas"
brew "readline"
# brew "graphviz"
brew "git"
brew "python3"
brew "pyenv"
# brew "imagemagick"
brew "jq"
brew "nginx"
brew "ripgrep"
brew "speedtest-cli"
brew "trash"
# brew "thefuck"
brew "fzf"
brew "htop"
brew "ssh-copy-id", link: true
brew "telnet"
brew "tfenv"
brew "tldr"
brew "tmux"
brew "tree"
brew "unzip"
brew "youtube-dl"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "neovim"
brew "wget"
brew "node"
brew "nvm"
brew "typescript"
brew "kotlin"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "imagemagick"
brew "java"
brew "slides"
brew "mermaid-cli"
brew "brew install gnupg"
brew "sd"
brew "gh"
brew "tfswitch"
brew "awscli"
brew "aws-okta"
brew "steampipe"
brew "yarn"
brew "patat-bin"
brew "graphviz"
brew "act"
brew "bruno"

# GUI applications
cask "google-drive"
cask  "maccy"
# cask "anki"
cask "bitwarden"
# cask "dash"
cask "docker"
cask "firefox"
cask "flux"
# cask "google-chrome"
# cask "imageoptim"
cask "iterm2"
cask "ngrok"
# cask "insomnia"
cask "postman"
cask "quicklook-json"
cask "visual-studio-code"
cask "vlc"
cask "slack"
cask "gimp"
cask "spotify"
# cask "discord"
# cask "alfred"
cask "jetbrains-toolbox"
# cask "nextcloud"
cask "obsidian"
cask "stats"
# cask "teamviewer"
# cask "zerotier-one"
# cask "private-internet-access"
# cask "steam"
cask "lastpass"
cask "google-cloud-sdk" # for gcloud CLI
cask "dbeaver-community"
cask "hammerspoon"
cask "xquartz"
cask "sourcetree"
cask "aws-vpn-client"
cask "pineapple"
cask "libreoffice"
cask "alfred"
cask "bartender"
cask "brewfile"
cask "dash"
cask "etats"
cask "1password"

# Applications not on Brew, but on the Mac App Store
mas "Amphetamine", id:937984704
